<template>
  <el-dialog
    title=" "
    :visible.sync="agreementDialog"
    :close-on-click-modal="false"
    width="60%">
    <div class="ptext">
      <h1>责任声明</h1>
      <p> 首先，感谢您支持网络指令开发平台的服务！ 《网络指令开发平台协议》 （以下称为“本协议”）是由联通广东分公司自主研发团队与您签订的关于平台功能服务使用过程中的事项和责任说明</p>

      <h3>一、协议条款的确认</h3>
      <p> 您勾选通过协议条款按钮后，即视为您已阅读、了解并完全同意协议条款中的各项内容，包括本网站对协议条款所作的任何修改以及相关公告的规定。除另行明确声明外，本网站任何服务范围或功能的变化均受服务条款约束。</p>

      <h3>二、协议条款的修改</h3>
      <p> 网站在必要时可修改服务条款，并在网站进行公告，一经公告，立即生效。如您继续使用服务，则视为您已接受修订的服务条款。</p>

      <h3>三、用户注册和资料保密</h3>
      <p> 考虑到本网站用户服务的重要性，通过关联联通正式员工账号信息（公司OA账号），网站用户注册实行实名制；如发生变化请及时更新。</p>
      <p> 您负有对用户名和密码保密的义务，并对该用户名和密码下发生的所有活动承担责任。请您不要把用户名、密码和注册时填写的个人信息提供给第三方网站或他人使用。</p>
      <p> 您同意邮件通知服务、短信通知服务、微信通知服务的使用由您自己承担风险。</p>
      <p> 您同意并授权自研团队出于提升网站服务水平目的收集并使用您在网络指令开发平台中的操作提供的个人信息。</p>
      <p> 本网站不会向您所使用服务所涉及相关方之外的其他方公开或透露您的个人资料，法律法规规定除外。</p>

      <h3>四、责任免除和限制</h3>
      <p> 1)遇以下情况，本网站不承担任何责任，包括但不仅限于：
      <p> a)因不可抗力、系统故障、通讯故障、网络拥堵、供电系统故障、恶意攻击等造成本网站未能及时、准确、完整地提供服务。</p>
      <p> b)无论在任何原因下，您通过使用本网站上的信息或由本网站链接的其他网站上的信息，或其他与本网站链接的网站上的信息所导致的任何损失或损害。</p>
      <p> c)在注册用户被暂停使用以及因此导致网站相关操作失去控制等后果。</p>
      <p> 2)本网站负责对本网站上的信息进行核验与更新，但并不就信息的时效性、准确性以及服务功能的完整性和可靠性承担任何义务和赔偿责任。</p>
      <p> 3)如用户利用本网站的差错、故障或其他原因导致的漏洞，损害本网站及任何第三方的权益，本网站将终止该用户资格，并保留法律追究的权利。</p>
      <p> 4)如果本网站发现有影响用户信息安全的行为，本网站有权对用户信息实施保护。必要时用户需经重新验证身份后方可继续使用。</p>
      <p> 5)正常使用情况下，用户对当前账号下所有操作使用行为以及所产生的后果负责。</p>

      <h3>五、保障</h3>
      <p> 您同意保障和维护本网站的利益，并承担您或其他人使用您的用户资料造成本网站或任何第三方的损失或损害的赔偿责任。</p>

      <h3>六、知识产权</h3>
      <p> 本网站所有内容和资源的版权归本网站所有(除非本网站已经标明版权所有人)，页面所有信息受《中华人民共和国著作权法》及相关法律法规和中国加入的所有知识产权方面的国际条约的保护。未经本网站事先的书面许可，任何单位和个人不得就本网站上的相关资源以任何方式、任何文字做全部或局部复制、修改、发送、储存、发布、交流或分发，或利用本网站上的相关资源创建其他商业用途的资源。否则本网站将追究其法律责任。</p>

      <h3>七、法律适用和管辖</h3>
      <p> 本服务条款之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因您使用本网站而导致的争议，您同意接受本网站注册地人民法院的管辖。本网站享有对服务条款的最终解释与修改权。</p>
          
    </div>
    <span slot="footer" class="dialog-footer">
    <el-button size="small" type="primary" @click="agreementDialog = false">确 定</el-button>
  </span>
  </el-dialog>
</template>
<script>
  export default{
    name:'agreement',
    data(){
      return{
        agreementDialog: false
      }
    },
    methods:{

    },
    mounted(){

    }
  }
</script>
<style lang="stylus" scoped>
  >>>.el-dialog__body{
    padding 0 20px
    .ptext{
      h1{
        text-align: center;
      }
      h3{
        margin-top 20px
      }
    }
  }
  
</style>
